// NameTable.cpp : 定义控制台应用程序的入口点。
//

#include "stdafx.h"

#include <cstdio>
#include <fstream>
#include <iostream>
#include <windows.h>


typedef struct NamePair
{
	unsigned int iPos;
	char* str;
};

NamePair Name[] =
{
{0x00000048,"　 ？？？ 　"},
{0x00000057,"　？雪々　　"},
{0x00000083,"　　雪雪　　~　　陸　　"},
{0x0000009d,"　　雪雪　　"},
{0x000000c9,"　　雪雪　　"},
{0x000000d8,"　　雪々　　"},
{0x00000104,"　  女孩  　"},
{0x00000113,"　？雪々　　"},
{0x0000013f,"　　　　　　"},
{0x0000014e,"　　雪々　　"},
{0x00000182,"　　　　　　"},
{0x00000191,"　 Ｍ雪々 　"},
{0x000001b3,"　　雪々　　"},
{0x0000025a,"　 ？？？ 　"},
{0x00000269,"　 ？落叶 　"},
{0x00000295,"　　一起　　"},
{0x000002a4,"　　落叶　　"},
{0x000002d8,"　　　　　"},
{0x000002e5,"　 Ｍ落叶 　"},
{0x00000307,"　　落叶　　"},
{0x000003be,"　 ？？？ 　"},
{0x000003cd,"　 ？一夏 　"},
{0x000003f9,"　　一起　　"},
{0x00000408,"　　一夏　　"},
{0x0000042a,"　　一夏　　"},
{0x000004d1,"　 ？？？ 　"},
{0x000004e0,"　 ？铃音 　"},
{0x0000050c,"　  铃音  　"},
{0x0000051b,"　幼年铃音　"},
{0x0000053d,"　  铃音  　"},
{0x000005e4,"　 ？？？ 　"},
{0x000005f3,"　？科罗娜　"},
{0x00000615,"　 科罗娜 　"},
{0x000006bc,"　 ？？？ 　"},
{0x000006cb,"　 ？琴里 　"},
{0x000006ed,"　　琴里　　"},
{0x00000794,"　 ？？？ 　"},
{0x000007a3,"　　？幸　　"},
{0x000007c5,"　　 幸 　　"},
{0x0000086c,"　 ？？？ 　"},
{0x0000087b,"　 ？叶月 　"},
{0x0000089d,"　　叶月　　"},
{0x00000944,"　 ？？？ 　"},
{0x00000953,"　 ？日向 　"},
{0x00000975,"　  日向  　"},
{0x00000a1c,"　 ？？？ 　"},
{0x00000a2b,"　 ？美晴 　"},
{0x00000a4d,"　　美晴　　"},
{0x00000af4,"　 ？？？ 　"},
{0x00000b03,"　 ？千川 　"},
{0x00000b25,"　　千川　　"},
{0x00000bcc,"　 ？？？ 　"},
{0x00000bdb,"　　？累　　"},
{0x00000bfd,"　　 累 　　"},
{0x00000ca4,"　 ？？？ 　"},
{0x00000cb3,"　？麻里茂　"},
{0x00000cd5,"　 麻里茂 　"},
{0x00000d7c,"　 ？？？ 　"},
{0x00000d8b,"　 ？椎菜 　"},
{0x00000dad,"　　椎菜　　"},
{0x00000e54,"　 ？？？ 　"},
{0x00000e63,"　 ？柚子 　"},
{0x00000e85,"　　柚子　　"},
{0x00000f2c,"　 ？？？ 　"},
{0x00000f3b,"　？渡部　"},
{0x00000f5b,"　　渡部　　"},
{0x00001002,"　 ？？？ 　"},
{0x00001011,"　 ？大树 　"},
{0x0000103d,"　　大树　　"},
{0x0000104c,"　 ？大树 　"},
{0x0000106e,"　　大树　　"},
{0x00001115,"　 ？？？ 　"},
{0x00001124,"　 ？白羽 　"},
{0x00001150,"　　白羽　　"},
{0x0000115f,"　 ？白羽 　"},
{0x00001181,"　　白羽　　"},
{0x00001228,"　 ？？？ 　"},
{0x00001237,"？阿露毕蕾欧"},
{0x00001263,"　　兔兔　　"},
{0x00001272," 　？兔兔　 "},
{0x0000129e," 阿露毕蕾欧 "},
{0x000012ad,"？阿露毕蕾欧"},
{0x000012cf," 阿露毕蕾欧 "},
{0x00001376,"　 ？？？ 　"},
{0x00001385,"　 ？奶奶 　"},
{0x000013b1,"　　奶奶　　"},
{0x000013c0,"　 ？奶奶 　"},
{0x000013e2,"　　奶奶　　"},
{0x00001489,"　 ？？？ 　"},
{0x00001498,"　？前会长　"},
{0x000014c4,"　 前会长 　"},
{0x000014d3,"　？前会长　"},
{0x000014f5,"　 前会长 　"},
{0x00001573,"　 ？？？ 　"},
{0x00001582,"　 ？母亲 　"},
{0x0000159b,"　　母亲　　"},
{0x000015ec,"　 ？？？ 　"},
{0x000015fb," 　？母亲　 "},
{0x00001614,"　　母亲　　"},
{0x00001665,"　 ？？？ 　"},
{0x00001674,"　 ？母亲 　"},
{0x0000168d,"　　母亲　　"},
{0x000016de,"　 ？？？ 　"},
{0x000016ed,"？雪々的母亲"},
{0x00001718,"　　　　　　"},
{0x00001727,"Ｍ雪々的母亲"},
{0x00001740," 雪々的母亲 "},
{0x00001791,"　 ？？？ 　"},
{0x000017a0,"　　？椿　　"},
{0x000017c3,"　座敷童子　　  　　　"},
{0x000017dc,"　座敷童子　　　　　　"},
{0x00001808,"　　 椿 　　"},
{0x00001859,"　 ？？？ 　"},
{0x00001868," ？拉克利玛 "},
{0x0000188b,"　翻着花绳的~女孩 　　　　"},
{0x000018a8,"　翻着花绳的~女孩 　　　"},
{0x000018d6,"　拉克利玛　"},
{0x00001927,"　 ？？？ 　"},
{0x00001936,"？　 美凤 　"},
{0x00001959,"~用扇子遮住嘴~的女孩~ "},
{0x00001972,"用扇子遮住嘴~的女孩 "},
{0x0000199c," 　 美凤 　 "},
{0x000019ed,"　 ？？？ 　"},
{0x000019fc," ？米尔德丽德 "},
{0x00001a21,"戴眼罩~的女孩"},
{0x00001a31,"戴眼罩的女孩"},
{0x00001a53," 米尔德丽德 "},
{0x00001aa4,"　 ？？？ 　"},
{0x00001ab3," 　？露露　 "},
{0x00001ad6," 哔喽哔喽笛~的女孩 "},
{0x00001aec,"哔喽哔喽笛~的女孩 "},
{0x00001b14,"　　露露　　"},
{0x00001b65,"　 ？？？ 　"},
{0x00001b74,"　 ？父亲 　"},
{0x00001b8d,"　　父亲　　"},
{0x00001bde,"　 ？？？ 　"},
{0x00001bed,"　？圣护院　"},
{0x00001c10,"装腔作势男子"},
{0x00001c1f,"装腔作势男子"},
{0x00001c41,"　 圣护院 　"},
{0x00001c92,"　 ？？？ 　"},
{0x00001ca1,"　 ？父亲 　"},
{0x00001cba,"　　父亲　　"},
{0x00001d10,"　 ？？？ 　"},
{0x00001d1f,"　　？陆　　"},
{0x00001d4a,"　　 陆 　　"},
{0x00001d59,"　 幼年陆 　"},
{0x00001d84,"　　 陆 　　"},
{0x00001d93,"　 榛名陆 　"},
{0x00001db4,"　　 陆　　"},
{0x00045eb7,"　 ？？？ 　"},
{0x00045ef3,"　　雪々　　"},
{0x00045f2c,"　　落叶　　"},
{0x00045f3e,"　　全员　　"},
{0x00045f7a,"　　一夏　　"},
{0x00045fb5,"　  铃音  　"},
{0x00045ff0,"　 科罗娜 　"},
{0x0004602b,"　　琴里　　"},
{0x00046066,"　　 幸 　　"},
{0x0004609f,"　　叶月　　"},
{0x000460da,"　  日向  　"},
{0x00046115,"　　美晴　　"},
{0x00046150,"　　千川　　"},
{0x0004618b,"　　 累 　　"},
{0x000461c6,"　 麻里茂 　"},
{0x00046200,"　　椎菜　　"},
{0x0004623c,"　　柚子　　"},
{0x00046278,"　　渡部　　"},
{0x000462b4,"　　大树　　"},
{0x000462f0,"　　白羽　　"},
{0x0004632c," 阿露毕蕾欧 "},
{0x0004633e," 　？兔兔　 "},
{0x00046379,"　 前会长 　"},
{0x000463b5,"　　奶奶　　"},
{0x000463f1,"　　 陆　　"},
{0x0004642c,"　　母亲　　"},
{0x0004643e,"　　母亲　　"},
{0x00046451,"　　母亲　　"},
{0x00046464," 雪々的母亲 "},
{0x000464a1,"　　父亲　　"},
{0x000464b3,"　　父亲　　"},
{0x000464ee,"　 圣护院 　"},
{0x0004652a,"　　 椿 　　"},
{0x00046564,"　拉克利玛　"},
{0x000465a0," 　 美凤 　 "},
{0x000465dc," 米尔德丽德 "},
{0x00046618,"　　露露　　"},
{0x00046654,"　 Ｍ雪々 　"},
{0x00046666,"　 Ｍ落叶 　"},
{0x00046679,"Ｍ雪々的母亲"},
{0x000466de,"　？雪々　　"},
{0x000466f0,"　　雪々　　"},
{0x00046703,"　 Ｍ雪々 　"},
{0x00046723,"　 ？落叶 　"},
{0x00046735,"　　落叶　　"},
{0x00046748,"　　全员　　"},
{0x0004675b,"　 Ｍ落叶 　"},
{0x0004677b,"　 ？一夏 　"},
{0x0004678d,"　　一夏　　"},
{0x000467ad,"　 ？铃音 　"},
{0x000467bf,"　  铃音  　"},
{0x000467d2,"　幼年铃音　"},
{0x000467f2,"　？科罗娜　"},
{0x00046804,"　 科罗娜 　"},
{0x00046824,"　 ？琴里 　"},
{0x00046836,"　　琴里　　"},
{0x00046856,"　　？幸　　"},
{0x00046868,"　　 幸 　　"},
{0x00046888,"　 ？叶月 　"},
{0x0004689a,"　　叶月　　"},
{0x000468ba,"　 ？日向 　"},
{0x000468cc,"　  日向  　"},
{0x000468ec,"　 ？美晴 　"},
{0x000468fe,"　　美晴　　"},
{0x0004691e,"　 ？千川 　"},
{0x00046930,"　　千川　　"},
{0x00046950,"　　？累　　"},
{0x00046962,"　　 累 　　"},
{0x00046982,"　？麻里茂　"},
{0x00046994,"　 麻里茂 　"},
{0x000469b4,"　 ？椎菜 　"},
{0x000469c6,"　　椎菜　　"},
{0x000469e6,"　？渡部　"},
{0x000469f6,"　　渡部　　"},
{0x00046a16,"　 ？柚子 　"},
{0x00046a28,"　　柚子　　"},
{0x00046a48,"　 ？大树 　"},
{0x00046a5a,"　　大树　　"},
{0x00046a7a,"　 ？白羽 　"},
{0x00046a8c,"　　白羽　　"},
{0x00046aac,"？阿露毕蕾欧"},
{0x00046abe," 　？兔兔　 "},
{0x00046ad1," 阿露毕蕾欧 "},
{0x00046af1,"　 ？奶奶 　"},
{0x00046b03,"　　奶奶　　"},
{0x00046b23,"　？前会长　"},
{0x00046b35,"　 前会长 　"},
{0x00046b55,"　　？母　　"},
{0x00046b67,"　　母亲　　"},
{0x00046b7a," 　？母亲　 "},
{0x00046b8d,"　　母亲　　"},
{0x00046bad,"　 ？母亲 　"},
{0x00046bbf,"　　母亲　　"},
{0x00046bdf,"？雪々的母亲"},
{0x00046bf1," 雪々的母亲 "},
{0x00046c04,"Ｍ雪々的母亲"},
{0x00046c24,"　　？椿　　"},
{0x00046c36,"　座敷童子　　　　　　"},
{0x00046c53,"　　 椿 　　"},
{0x00046c73," ？拉克利玛 "},
{0x00046c85,"　翻着花绳的~女孩　 　　"},
{0x00046ca4,"　拉克利玛　"},
{0x00046cc4,"？　 美凤 　"},
{0x00046cd6,"用扇子遮住嘴~的女孩 "},
{0x00046cf1," 　 美凤 　 "},
{0x00046d11," ？米尔德丽德 "},
{0x00046d25,"戴眼罩的女孩"},
{0x00046d38," 米尔德丽德 "},
{0x00046d58,"　 ？露露 　"},
{0x00046d6a,"哔喽哔喽笛~的女孩 "},
{0x00046d83,"　　露露　　"},
{0x00046da3,"　 ？父亲 　"},
{0x00046db5,"　　父亲　　"},
{0x00046dd5,"　 ？父亲 　"},
{0x00046de7,"　　父亲　　"},
{0x00046e07,"　？圣护院　"},
{0x00046e19,"装腔作势男子"},
{0x00046e2c,"　 圣护院 　"},
{0x00059566,"“”。、？！」』☆）　"},
{0x0005973a,"　"},
{0x00059747,"~　"},
{0x00059797,"「"},
{0x000597c3,"~「"},
{0x00059807,"」"},
{0x0009ad5e,"“”。、？！」』☆）　"},
{0x0009ec31,"“”。、？！」』）　"},
{0x0009ed02,"“”。、？！」』）　"},
{0x000a05d3,"“”。、？！」』）　"},
{0,""}
};

using namespace std;
int main(int argc, char **argv)
{
	if(argc != 2)
		return -1;
	
	FILE* text = fopen(argv[1],"rb");
	if(text == NULL)
	{
		MessageBoxA(NULL, "Cannot Open hcb Resource!", "FVPCompiler", MB_OK);
		return -1;
	}
	fseek(text,0,SEEK_END);
    unsigned __int32 dwFileSize=ftell(text);
    rewind(text);
    char *wFile = new char[dwFileSize];
   	fread(wFile,dwFileSize,1,text);
	fclose(text);
	
	int i = 0;
	while(Name[i].iPos != 0)
	{
		if(wFile[Name[i].iPos] == 0x0E)
		{
			if(wFile[Name[i].iPos + 1] == (strlen(Name[i].str)+1))
			{
				strcpy((wFile+ Name[i].iPos +2), Name[i].str);
				printf("Writing : %s\n", wFile + Name[i].iPos + 2);
			}
			else
			{
				printf("Diff Len[%08x], Ori[%d], Now[%d]\n", Name[i].iPos, wFile[Name[i].iPos + 1], strlen(Name[i].str)+1);
				char tmp[MAX_PATH];
				sprintf(tmp, "Diff Len[%08x]", Name[i].iPos);
				printf("Writing Error: %s\n", wFile + Name[i].iPos + 2);
				MessageBoxA(NULL, tmp, "NameWriter", MB_OK);
			}
		}
		else
		{
			printf("Bad Code\n");
			char tmp[MAX_PATH];
			sprintf(tmp, "Bad Code [%08x]", Name[i].iPos);
			MessageBoxA(NULL, tmp, "NameWriter", MB_OK);
		}

		i++;
	}
	
	//Hook Movie Index;
	wFile[0x00061d03] = (unsigned char)0x03;
	wFile[0x00061d44] = (unsigned char)0x03;
	FILE *hcbNew = fopen("a.pck", "wb");
	fwrite(wFile,dwFileSize,1,hcbNew);
	fclose(hcbNew);

	getchar();
	return 0;
}

